Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedMemberLoad.CSCode Property
 Gets or sets the CS code of the decomposed member load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisDecomposedLoad.LoadCoordinateEnum CSCode { get; set; }
Public Property CSCode As AnalysisDecomposedLoad.LoadCoordinateEnum
	Get
	Set
Property Value
Type: AnalysisDecomposedLoad.LoadCoordinateEnum
See Also
Reference
AnalysisDecomposedMemberLoad Class
Tekla.Structures.Analysis Namespace